#+TITLE: building from source
#+DATE: 2021 Jun 18, Friday


* LIST

  These are build I have done form emacs source. Build are bit buggy
  but workable.

  #+HEADER: :dir ./repo
  #+HEADER: :results output prepend  :eval no-export
  #+BEGIN_SRC sh :exports both
    git log -1 --oneline
  #+END_SRC

  #+RESULTS:
  : 213b8e0 Eglot: un-canonicalize server URIs to project's root
  : 68e2a9c EUDC: Add eudc-ignore-options-file customization
  : 12a7871 Fix calculation of frame times when X server time overflows
  : e2d96ff * src/xterm.c (handle_one_xevent): Translate motion events on Motif.
  : 7be75f1 * lisp/printing.el (pr-global-menubar): Fix duplicate menu problem.
  : 663fb3b * Do not produce .elc temporary file when unnecessary (bug#48978)

* ISSUES
** tree-sitter crash [2026-04-16 Thu]

   After system upgrade the tree-sitter highlighting did not work
   showing error in =*Messages*= buffer.

   #+BEGIN_EXAMPLE
     Error during redisplay: (jit-lock-function 1) signaled (treesit-query-error "Syntax error at" 358 "[\"as\" \"assert\" \"async\" \"await\" \"break\" \"case\" \"class\" \"continue\" \"def\" \"del\" \"elif\" \"else\" \"except\" \"exec\" \"finally\" \"for\" \"from\" \"global\" \"if\" \"import\" \"lambda\" \"match\" \"nonlocal\" \"pass\" \"print\" \"raise\" \"return\" \"try\" \"while\" \"with\" \"yield\" \"and\" \"in\" \"is\" \"not\" \"or\" \"not in\" \"is not\"] @font-lock-keyword-face ((identifier) @font-lock-keyword-face (#match \"\\\\`self\\\\'\" @font-lock-keyword-face))" "Debug the query with `treesit-query-validate'")
   #+END_EXAMPLE

   #+HEADER: :results output :eval no-export
   #+BEGIN_SRC emacs-lisp
    (princ (format "treesit-library-abi-version: %s\n" (treesit-library-abi-version)))
    (princ (format "treesit-library-abi-version python: %s\n" (treesit-language-abi-version 'python)))
   #+END_SRC

   #+RESULTS:
   : treesit-library-abi-version: 15
   : treesit-library-abi-version python: 15

   + references
     - [[https://github.com/emacs-mirror/emacs/commit/d587ce8c65][d587ce8]] seem to be patch but not working from official packages
     - [[https://emacs.stackexchange.com/questions/85489/solve-version-mismatch-with-tree-sitter-in-emacs-30-1-and-later-without-recom][stackoverflow]] "version-mismatch" with tree-sitter in Emacs 30.1 and later, without recompiling

** clipboard issue [2022-11-11 Fri]

   could not assert ownership over selection seems like it originated
   from [[https://git.nsb-software.de/joerg/emacs/-/blob/1f61f10d9955c5d8f73749f5b3c880f8a408d782/src/pgtkselect.c#L165][pgtk]].
